In [3]:
import pandas as pd
df1=pd.read_csv('各鄉鎮市區人口密度.csv')
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 376 entries, 0 to 375
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   statistic_yyy       371 non-null    object
 1   site_id             375 non-null    object
 2   people_total        371 non-null    object
 3   area                371 non-null    object
 4   population_density  371 non-null    object
dtypes: object(5)
memory usage: 14.8+ KB

In [4]:
#reindex(),在Series的使用方法
s1 = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
s1

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [5]:
s1.reindex(index=['a','b','c','d'])

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [6]:
s1.reindex(index=['a','b'])

a   -5.3
b    7.2
dtype: float64

In [7]:
import numpy as np
df1 = pd.DataFrame(np.arange(9).reshape(3, 3),
            index=['a', 'c', 'd'],
            columns=['台北', '台中', '高雄'])
df1

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [8]:
df1.reindex(['a','c'])

   台北  台中  高雄
a   0   1   2
c   3   4   5

In [9]:
df1.reindex(index=['a', 'c'])

   台北  台中  高雄
a   0   1   2
c   3   4   5

In [10]:
df1.reindex(index=['a','c'], columns=['台北','台中'])

   台北  台中
a   0   1
c   3   4

In [11]:
#drop()刪除欄位或索引
#drop的方法

#Series
s1 = pd.Series(np.arange(5.),index=['a', 'b', 'c', 'd', 'e'])
s1

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [12]:
s1.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [13]:
s1.drop(['a','c'])

b    1.0
d    3.0
e    4.0
dtype: float64

In [14]:
#dataFrame
#DataFrame
df1 = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
df1

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [15]:
df1.drop(['one','two'],axis=1)

    three  four
台北      2     3
台中      6     7
台南     10    11
高雄     14    15

In [16]:
df1.drop(['台北','台中'])

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [17]:
df1.drop(columns=['one','two'])

    three  four
台北      2     3
台中      6     7
台南     10    11
高雄     14    15

In [18]:
df1.drop(index=['台北','台中'])

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15